app/controllers/application_controller.rb

SELECT "user_registrations".* FROM "user_registrations" WHERE "user_registrations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
	def current_user
		@current_user ||= UserRegistration.find(session[:user_id]) if session[:user_id]