app/controllers/images_controller.rb

  def create
    @image = Image.new(image_params)

    if @image.save
---
INSERT INTO "images" ("title", "description", "file_type", "category", "sale", "price", "tnc", "created_at", "updated_at", "avatar") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def update
    @image = Image.find(params[:id])

    if @image.update(image_params)
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "images" SET "price" = ?, "updated_at" = ? WHERE "images"."id" = ?  [["price", 100.0], ["updated_at", "2021-07-02 06:32:45.812775"], ["id", 9]]

  def destroy
    @image = Image.find(params[:id])
    @image.destroy
---
SELECT "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 9]]