app/controllers/user_registrations_controller.rb

  def show
    @user = UserRegistration.find(params[:id])
---
SELECT "user_registrations".* FROM "user_registrations" WHERE "user_registrations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def create
  	@user = UserRegistration.find_by(phone: user_registration_params[:phone])
    if @user.present?
      @user.send_passcode
    	redirect_to @user
    else
	    @user = UserRegistration.new(user_registration_params)

	    if @user.save && @user.send_passcode
---
SELECT "user_registrations".* FROM "user_registrations" WHERE "user_registrations"."phone" = ? LIMIT ?  [["phone", 8746043730], ["LIMIT", 1]]
SELECT 1 AS one FROM "user_registrations" WHERE "user_registrations"."phone" = ? LIMIT ?  [["phone", 8746043730], ["LIMIT", 1]]
UPDATE "user_registrations" SET "secret_key" = ?, "otp_status" = ? WHERE "user_registrations"."id" = ?  [["secret_key", "a29a4741-c795-4414-a1cc-77d7b0088605"], ["otp_status", 0], ["id", 7]]
INSERT INTO "user_registrations" ("phone", "created_at", "updated_at") VALUES (?, ?, ?)  [["phone", 8746043730], ["created_at", "2021-07-02 06:17:37.468556"], ["updated_at", "2021-07-02 06:17:37.468556"]]

  def verify_otp
  	@user = UserRegistration.find(params[:id])
---
SELECT "user_registrations".* FROM "user_registrations" WHERE "user_registrations"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]